import { useState } from "react";
import AccordionLayout from "../Faq/FaqLayout";

const FAQ = () => {
  const [activeIndex, setActiveIndex] = useState<string | number>(1);
  return (
    <div className="mx-auto px-4 pt-12 font-lexend sm:max-w-xl md:max-w-full md:px-24 lg:max-w-7xl lg:px-8 lg:pt-16">
      <h3 className="text 3xl pb-12 text-center font-bold text-gray-800 dark:text-gray-200 lg:text-4xl">
        ಪದೇಪದೆ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು
      </h3>
      {Data.map((items) => (
        <AccordionLayout
          title={items.title}
          key={items.id}
          index={items.id}
          activeIndex={activeIndex}
          setActiveIndex={setActiveIndex}
        >
          {items.contents}
        </AccordionLayout>
      ))}
    </div>
  );
};

export default FAQ;

const Data = [
  {
    id: 1,
    title: "ಪರಿಪೂರ್ಣ ಕೊಡುಗೆಗೆ ನೋಂದಾಯಿಸಿಕೊಳ್ಳುವುದು ಹೇಗೆ?",
    contents: (
      <div>
        ಪರಿಪೂರ್ಣಗೆ ನೋಂದಾಯಿಸಿಕೊಳ್ಳಲು, ನಮ್ಮ ಯಾವುದೇ ಶಾಖೆಗೆ ಭೇಟಿ ನೀಡಿ. ಫಲವತ್ತತೆ
        ತಜ್ಞರನ್ನು ಭೇಟಿ ಮಾಡಲು ಅಥವಾ ಸಮಾಲೋಚಿಸಲು 9108 9108 22 ನಂಬರ್‌ ಸಂಪರ್ಕಿಸಿ. ನಾವು
        ನಿಮಗೆ ಪ್ರತಿಯೊಂದನ್ನೂ ಹಂತ ಹಂತವಾಗಿ ತಿಳಿಸುತ್ತೇವೆ ಮತ್ತು ಪ್ರಕ್ರಿಯೆಯನ್ನು
        ಸರಾಗವಾಗಿ ಪೂರ್ಣಗೊಳಿಸಲು ನೆರವಾಗುತ್ತೇವೆ.
      </div>
    ),
  },
  {
    id: 2,
    title: "ಪರಿಪೂರ್ಣ ಪಡೆಯಲು ಯಾರು ಅರ್ಹರು?",
    contents: (
      <div>
        ಸಂತಾನೋತ್ಪತ್ತಿ ಚಿಕಿತ್ಸೆ ಪಡೆಯಲು ಬಯಸುವ ದಂಪತಿಗಳಿಗೆ ಹಣಕಾಸಿನ ನೆರವು
        ಅಗತ್ಯವಿದ್ದಲ್ಲಿ ಪರಿಪೂರ್ಣ ಕೊಡುಗೆ ಸಹಾಯವಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: 3,
    title: `ನೋಂದಾಯಿಸಿಕೊಳ್ಳುವ ಪ್ರತಿಯೊಬ್ಬರೂ ಪರಿಪೂರ್ಣ ಪ್ರಯೋಜನವನ್ನು ಪಡೆಯಲು ಅರ್ಹರೇ?`,
    contents: (
      <div>
        ನೋಂದಣಿಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಿದ ನಂತರ, ಫಲವತ್ತತೆ ತಜ್ಞರೊಂದಿಗೆ ಸಮಾಲೋಚನೆಗೆ ಒಳಗಾದ
        ನಂತರ, ಪರೀಕ್ಷೆಯ ನಂತರ ಮತ್ತು ದಂಪತಿಗಳ ವಿಶಿಷ್ಟ ಅಗತ್ಯಗಳನ್ನು ಪೂರೈಸಲು
        ಚಿಕಿತ್ಸೆಯನ್ನು ಸೂಚಿಸಿದ ನಂತರ ದಂಪತಿಗಳು ಪರಿಪೂರ್ಣಗೆ ಅರ್ಹರಾಗಿರುತ್ತಾರೆ.
      </div>
    ),
  },
  {
    id: 4,
    title: `ಅರ್ಹತೆಗೆ ಮಾನದಂಡ ಇದೆಯಾ?`,
    contents: (
      <div>
        IVF ಚಿಕಿತ್ಸೆಯನ್ನು ಪಡೆಯಲು ಬಯಸುವ ದಂಪತಿಗಳಿಗೆ ಮಾತ್ರ ಪರಿಪೂರ್ಣ ಅನ್ವಯಿಸುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: 5,
    title: `ಅರ್ಹತೆ ಇದ್ದರೆ, ನಾನು ಟ್ರೀಟ್ಮೆಂಟ್‌ ಪ್ಲಾನ್‌ ಪಡೆಯಬಹುದೆ?`,
    contents: (
      <div>
        ಹೌದು, ನೀವು ಫಲವತ್ತತೆ ತಜ್ಞರಿಂದ ಟ್ರೀಟ್ಮೆಂಟ್‌ ಪ್ಲಾನ್‌ ಅನ್ನು ಪಡೆಯಬಹುದು.
      </div>
    ),
  },
  {
    id: 6,
    title: `ಪರಿಪೂರ್ಣ ಯೋಜನೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡದೆ ನಾನು ನನ್ನ ಚಿಕಿತ್ಸೆಯನ್ನು ಮುಂದುವರಿಸಬಹುದೇ?`,
    contents: (
      <div>
        ಹೌದು, ಪರಿಪೂರ್ಣ ಉಡುಗೊರೆ ನಿಜವಾಗಿ ಅಗತ್ಯವಿರುವ ಇತರೆ ದಂಪತಿಗಳು ಪಡೆಯಲು
        ಸಹಾಯವಾಗುತ್ತದೆ.{" "}
      </div>
    ),
  },
  {
    id: 7,
    title: `ಪರಿಪೂರ್ಣಗೆ ಅರ್ಜಿ ಸಲ್ಲಿಸಲು ಕೊನೆಯ ದಿನಾಂಕ ಯಾವುದು?`,
    contents: <div>ಡಿಸೆಂಬರ್ 31, 2025 ರವರೆಗೆ ಪರಿಪೂರ್ಣ ಕೊಡುಗೆ ಲಭ್ಯವಿದೆ.</div>,
  },
  {
    id: 8,
    title: `ನಾನು ಇತರೆ ಆಸ್ಪತ್ರೆಯಲ್ಲಿ ಚಿಕಿತ್ಸೆ ಪಡೆಯುತ್ತಿದ್ದಾಗಲೂ, ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರದಲ್ಲಿ ಪರಿಪೂರ್ಣ  ಪಡೆಯಲು  ಅರ್ಹನಾಗಿರುತ್ತೇನೆಯೆ?`,
    contents: (
      <div>
        ಹೌದು, ನೀವು ಅರ್ಜಿ ಸಲ್ಲಿಸಬಹುದು, ಆದರೆ ಚಿಕಿತ್ಸೆಯನ್ನು ನಿಲ್ಲಿಸಬೇಡಿ ಎಂದು ನಾವು
        ಶಿಫಾರಸು ಮಾಡುತ್ತೇವೆ, ಏಕೆಂದರೆ ಅದು ಅದರ ಯಶಸ್ಸಿನ ದರದ ಮೇಲೆ ಪರಿಣಾಮ ಬೀರಬಹುದು.
      </div>
    ),
  },
  {
    id: 9,
    title: `ಗರ್ಭಗುಡಿ ಸೆಂಟರ್‌ಗೆ ಭೇಟಿ ನೀಡದೆ ನಾನು ಆನ್‌ಲೈನ್ ಮೂಲಕ ಪರಿಪೂರ್ಣಗೆ ನೋಂದಾಯಿಸಿಕೊಳ್ಳಬಹುದೇ?`,
    contents: (
      <div>
        ನಮ್ಮ ಯಾವುದೇ ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರಗಳಲ್ಲಿ ಮೊದಲು ಪರೀಕ್ಷೆ ಮಾಡಿಸಿಕೊಂಡು, ಅದರ
        ಆಧಾರದ ಮೇಲೆ ಐವಿಎಫ್‌ ಚಿಕಿತ್ಸೆ ಪಡೆಯಲು ಅರ್ಹರಾಗಿರುವ ದಂಪತಿಗಳಿಗೆ ಮಾತ್ರ ಪರಿಪೂರ್ಣ
        ಅನ್ವಯಿಸುತ್ತದೆ.
      </div>
    ),
  },
];
