const TermsConditions = () => {
  return (
    <div className="mx-auto px-4 pt-12 sm:max-w-xl md:max-w-full md:px-24 lg:max-w-7xl lg:px-8 lg:pt-16">
      <h3 className="pb-12 text-center font-lexend text-3xl font-bold text-gray-800 dark:text-gray-200 lg:text-4xl">
        ನಿಯಮಗಳು ಮತ್ತು ಷರತ್ತುಗಳು
      </h3>
      <div className="pb-4 font-lexend text-base text-gray-800 dark:text-gray-200">
        ದಂಪತಿಗಳಿಗೆ ಮತ್ತು ಮಹಿಳೆಯರಿಗೆ ವಿಶೇಷವಾದ ಮತ್ತು ಇತ್ತೀಚಿನ ಅತ್ಯಾಧುನಿಕ ಆರೋಗ್ಯ
        ಸೇವೆಗಳನ್ನು ನೀಡುವ ದೇಶದ ಪ್ರಮುಖ ಫೌಂಡೇಷನ್‌ಗಳಲ್ಲಿ ಗರ್ಭಜ್ಞಾನ್ ಫೌಂಡೇಶನ್
        ಒಂದಾಗಿದೆ. ಹಲವು ಕಾರಣಗಳಿಂದಾಗಿ ಪ್ರಪಂಚದಾದ್ಯಂತ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ
        ಹೆಚ್ಚುತ್ತಿರುವ ಕಾರಣ, ಗರ್ಭಜ್ಞಾನ್ ಫೌಂಡೇಶನ್ ದಂಪತಿಗಳು ತಮ್ಮ ತಾಯ್ತನದ ಸಂತೋಷ
        ಮತ್ತು ಕುಟುಂಬ ಜೀವನದ ಆನಂದವನ್ನು ಅನುಭವಿಸಲು ಸಹಾಯ ಮಾಡುವಲ್ಲಿ ದೃಢವಾಗಿದೆ.
        <br />
        <br />
        ಮಗು ಬಯಸುವ ದಂಪತಿಗಳಿಗೆ ಸಹಾಯ ಮಾಡಲು ಗರ್ಭಜ್ಞಾನ್ ಫೌಂಡೇಶನ್{" "}
        <strong> "ಪರಿಪೂರ್ಣ 2025"</strong>, ಅನ್ನು ನೀಡಲು ನಿರ್ಧರಿಸಿದೆ. ಗರ್ಭಗುಡಿ
        ಐವಿಎಫ್ ಕೇಂದ್ರವು ನೀಡುವ ರಿಯಾಯಿತಿಯನ್ನು ಗರ್ಭಜ್ಞಾನ್ ಫೌಂಡೇಶನ್ ತನ್ನ ಸಿಎಸ್ಆರ್
        ಚಟುವಟಿಕೆಯ ಭಾಗವಾಗಿ ಭರಿಸುತ್ತಿದೆ.
      </div>
      <ul role="list" className="pb-12">
        {items.map((item) => (
          <li
            key={item.id}
            className="ml-4 max-w-5xl list-outside list-disc rounded-md py-2 text-left font-lexend text-base text-gray-800 dark:text-gray-200 sm:px-6 lg:mx-auto"
          >
            {item.title}
          </li>
        ))}
      </ul>
    </div>
  );
};

export default TermsConditions;

const items = [
  {
    id: 1,
    title: "ದಂಪತಿಗಳು ಭಾರತದ ನಾಗರಿಕರು ಮತ್ತು ನಿವಾಸಿಗಳಾಗಿರಬೇಕು.",
  },
  {
    id: 2,
    title:
      "ಗರ್ಭಗುಡಿ ಐವಿಎಫ್ ಕೇಂದ್ರದಲ್ಲಿ ಒದಗಿಸಲಾದ ಯಾವುದೇ ಇತರೆ ಪ್ರಯೋಜನದೊಂದಿಗೆ ಪರಿಪೂರ್ಣವನ್ನು ಸೇರಿಸಲಾಗುವುದಿಲ್ಲ.",
  },
  {
    id: 3,
    title: "ಪರಿಪೂರ್ಣ ಕೊಡುಗೆಯನ್ನು ವರ್ಗಾಯಿಸಲಾಗುವುದಿಲ್ಲ.",
  },
  {
    id: 4,
    title: " ಪ್ರಯೋಜನವನ್ನು ಪಡೆಯಲು ಯಾವುದೇ ಆಫರ್ ಕೋಡ್ ಅಗತ್ಯವಿಲ್ಲ.",
  },
  {
    id: 6,
    title:
      "ಪರಿಪೂರ್ಣ ಯೋಜನೆಯು ಉಲ್ಲೇಖಿಸಲಾದ ದಿನಾಂಕದಂದು ಕೊನೆಗೊಳ್ಳುತ್ತದೆ ಮತ್ತು ಗರ್ಭಗುಡಿಯು ನಿರ್ದಿಷ್ಟಪಡಿಸದ ಹೊರತು ಯಾವುದೇ ಸಂದರ್ಭಗಳಲ್ಲಿ ಅದನ್ನು ವಿಸ್ತರಿಸಲಾಗುವುದಿಲ್ಲ.",
  },
  {
    id: 9,
    title:
      "ಎಲ್ಲಾ ನಿಯಮಗಳು ಮತ್ತು ಷರತ್ತುಗಳು ಸೂಚನೆ ಇಲ್ಲದೆ ಬದಲಾವಣೆಗೆ ಒಳಪಟ್ಟಿರುತ್ತವೆ, ಇದು ಗರ್ಭಗುಡಿ ಐವಿಎಫ್ ಕೇಂದ್ರ ಮತ್ತು ಗರ್ಭಜ್ಞಾನ್‌ ಫೌಂಡೇಷನ್‌ನ ಸ್ವಂತ ವಿವೇಚನೆಗೆ ಒಳಪಟ್ಟಿರುತ್ತದೆ.",
  },
  {
    id: 10,
    title: " ಹೆಚ್ಚುವರಿ ನಿಯಮಗಳು ಮತ್ತು ಷರತ್ತುಗಳು ಅನ್ವಯಿಸಬಹುದು.",
  },
];
