import React from "react";
import AccordionLayout from "sections/Faq/FaqLayout";

const Faq = () => {
  const [activeIndex1, setActiveIndex1] = React.useState(1);
  return (
    <div className="bg-fuchsia-50">
      <h2 className="pt-10 lg:pt:16 text-3xl lg:text-4xl font-heading font-bold text-center">
        ಪದೇ ಪದೇ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು
      </h2>
      <div className="pb-10 lg:pb-16 px-3">
        <div className="flex flex-col justify-center max-w-6xl mx-auto mt-10">
          {data.map((items) => (
            <AccordionLayout
              title={items.Question}
              key={items.id}
              index={items.id}
              activeIndex={activeIndex1}
              setActiveIndex={setActiveIndex1}
            >
              {items.Answer}
            </AccordionLayout>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Faq;

const data = [
  {
    id: 1,
    Question: "ಬೆಂಗಳೂರಿನಲ್ಲಿ ಐವಿಎಫ್ ಚಿಕಿತ್ಸೆಗೆ ಎಷ್ಟು ವೆಚ್ಚವಾಗುತ್ತದೆ?",
    Answer:
      "ಬೆಂಗಳೂರಿನಲ್ಲಿ IVF ಚಿಕಿತ್ಸೆಯ ವೆಚ್ಚವು ವೈಯಕ್ತಿಕ ಸಂದರ್ಭಗಳು ಮತ್ತು ಚಿಕಿತ್ಸೆಯ ಅವಶ್ಯಕತೆಗಳನ್ನು ಅವಲಂಬಿಸಿ ಬದಲಾಗಬಹುದು. ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರದಲ್ಲಿ, ನಾವು INR 90,000 ರಿಂದ ಪ್ರಾರಂಭವಾಗುವ ವಿವಿಧ IVF ಪ್ಯಾಕೇಜ್‌ಗಳನ್ನು ನೀಡುತ್ತೇವೆ.",
  },
  {
    id: 2,
    Question:
      "ಬೆಂಗಳೂರಿನಲ್ಲಿ ಯಾವ ಐವಿಎಫ್ ಕ್ಲಿನಿಕ್ ಹೆಚ್ಚು ಯಶಸ್ಸಿನ ಪ್ರಮಾಣವನ್ನು ಹೊಂದಿದೆ?",
    Answer:
      "ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರವು ಹೆಚ್ಚಿನ ಯಶಸ್ಸಿನ ಪ್ರಮಾಣವನ್ನು ಹೊಂದಿದೆ, ನಮ್ಮ ಅನೇಕ ದಂಪತಿಗಳು ಯಶಸ್ವಿ ಗರ್ಭಧಾರಣೆಯನ್ನು ಸಾಧಿಸುತ್ತಿದ್ದಾರೆ. ಆದಾಗ್ಯೂ, ವೈಯಕ್ತಿಕ ಅಂಶಗಳನ್ನು ಅವಲಂಬಿಸಿ ಯಶಸ್ಸಿನ ದರಗಳು ಬದಲಾಗಬಹುದು ಎಂಬುದನ್ನು ಗಮನಿಸುವುದು ಮುಖ್ಯ.",
  },
  {
    id: 3,
    Question: "ಗರ್ಭಗುಡಿ ಆಸ್ಪತ್ರೆಯು ಫಲವತ್ತತೆ ಚಿಕಿತ್ಸೆಯನ್ನು ನೀಡುತ್ತದೆಯೇ?",
    Answer:
      "ಹೌದು, ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರವು ಗರ್ಭಗುಡಿ ಆಸ್ಪತ್ರೆಯ ಭಾಗವಾಗಿದೆ, ಇದು ವ್ಯಾಪಕವಾದ ಫಲವತ್ತತೆ ಚಿಕಿತ್ಸೆಯನ್ನು ನೀಡುತ್ತದೆ.",
  },
  {
    id: 4,
    Question:
      "ಐವಿಎಫ್ ಚಿಕಿತ್ಸೆ ಪಡೆಯಲು ಗರ್ಭಗುಡಿ ಆಸ್ಪತ್ರೆಯನ್ನು ಏಕೆ ಆಯ್ಕೆ ಮಾಡಿಕೊಳ್ಳಬೇಕು?",
    Answer:
      "ಗರ್ಭಗುಡಿ ಐವಿಎಫ್ ಕೇಂದ್ರವು ಅತ್ಯಾಧುನಿಕ ತಂತ್ರಜ್ಞಾನ ಮತ್ತು ಅನುಭವಿ ವೈದ್ಯರನ್ನು ಬಳಸಿಕೊಂಡು ಸುಧಾರಿತ ಬಂಜೆತನದ ಚಿಕಿತ್ಸೆಯನ್ನು ನೀಡುತ್ತದೆ. ನಮ್ಮ ತಜ್ಞರ ತಂಡವು ಎಲ್ಲಾ ದಂಪತಿಗಳಿಗೆ  ವೈಯಕ್ತೀಕರಿಸಿದ ಆರೈಕೆಯನ್ನು ಒದಗಿಸುತ್ತದೆ ಮತ್ತು ಸಾಧ್ಯವಾದಷ್ಟು ಉತ್ತಮ ಫಲಿತಾಂಶಗಳನ್ನು ಸಾಧಿಸಲು ಶ್ರಮಿಸುತ್ತದೆ.",
  },
  {
    id: 5,
    Question: "ಬೆಂಗಳೂರಿನ ಅತ್ಯುತ್ತಮ ಬಂಜೆತನದ ವೈದ್ಯರು ಯಾರು?",
    Answer:
      'ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರದಲ್ಲಿ, ನಾವು ನಮ್ಮ ಎಲ್ಲಾ ದಂಪತಿಗಳಿಗೆ ಸಾಧ್ಯವಾದಷ್ಟು ಉತ್ತಮವಾದ ಆರೈಕೆಯನ್ನು ಒದಗಿಸಲು ಸಮರ್ಪಿತವಾಗಿರುವ ಹೆಚ್ಚು ಅನುಭವಿ ಬಂಜೆತನ ತಜ್ಞರ ತಂಡವನ್ನು ಹೊಂದಿದ್ದೇವೆ. ನಮ್ಮ ಎಲ್ಲಾ ವೈದ್ಯರು ತಮ್ಮ ಕ್ಷೇತ್ರಗಳಲ್ಲಿ ಹೆಚ್ಚು ನುರಿತ ಮತ್ತು ಅನುಭವಿಗಳಾಗಿರುವುದರಿಂದ ನಾವು ಯಾವುದೇ ಒಬ್ಬ ವೈದ್ಯರನ್ನು "ಅತ್ಯುತ್ತಮ" ಎಂದು ಪ್ರತ್ಯೇಕಿಸುವುದಿಲ್ಲ.',
  },
  {
    id: 6,
    Question: "IVF 100% ನಿಖರವಾಗಿದೆಯೇ?",
    Answer:
      "IVF ಹೆಚ್ಚು ನಿಖರವಾದ ಮತ್ತು ಪರಿಣಾಮಕಾರಿ ಫಲವತ್ತತೆ ಚಿಕಿತ್ಸೆಯಾಗಿದೆ, ಆದರೆ ವೈಯಕ್ತಿಕ ಅಂಶಗಳ ಆಧಾರದ ಮೇಲೆ ಯಶಸ್ಸಿನ ದರಗಳು ಬದಲಾಗಬಹುದು ಎಂಬುದನ್ನು ಗಮನಿಸುವುದು ಮುಖ್ಯವಾಗಿದೆ.",
  },
  {
    id: 7,
    Question: "ಭಾರತದಲ್ಲಿನ IVF ವೆಚ್ಚಗಳನ್ನು ವಿಮೆ ಆವರಿಸುತ್ತದೆಯೇ?",
    Answer:
      "ಭಾರತದಲ್ಲಿ, IVF ಚಿಕಿತ್ಸೆಗಾಗಿ ವಿಮಾ ರಕ್ಷಣೆಯು ಪಾಲಿಸಿ ಮತ್ತು ವಿಮಾ ಪೂರೈಕೆದಾರರನ್ನು ಅವಲಂಬಿಸಿ ಬದಲಾಗಬಹುದು. IVF ಚಿಕಿತ್ಸೆಯು ನಿಮ್ಮ ಪಾಲಿಸಿಯ ಅಡಿಯಲ್ಲಿ ಆವರಿಸಲ್ಪಟ್ಟಿದೆಯೇ ಎಂದು ನೋಡಲು ನಿಮ್ಮ ವಿಮಾ ಪೂರೈಕೆದಾರರೊಂದಿಗೆ ಪರಿಶೀಲಿಸುವುದು ಉತ್ತಮವಾಗಿದೆ. ಗರ್ಭಗುಡಿ IVF ಕೇಂದ್ರದಲ್ಲಿ, IVF ಚಿಕಿತ್ಸೆಯನ್ನು ಹೆಚ್ಚು ಕೈಗೆಟುಕುವಂತೆ ಮಾಡಲು ಮತ್ತು ನಮ್ಮ ರೋಗಿಗಳಿಗೆ ಪ್ರವೇಶಿಸಲು ಸಹಾಯ ಮಾಡಲು ನಾವು ವಿವಿಧ ಹಣಕಾಸು ಆಯ್ಕೆಗಳನ್ನು ಸಹ ನೀಡುತ್ತೇವೆ.",
  },
];
