export const maleInfertility = [
  {
    id: "1",
    title: "ಪುರುಷ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಸಾಮಾನ್ಯ ಕಾರಣಗಳು ಯಾವುವು?",
    contents: (
      <div>
        ಪುರುಷ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಸಾಮಾನ್ಯ ಕಾರಣಗಳು ವೆರಿಕೊಸೆಲೆ, ಸೋಂಕುಗಳು,
        ಮುಂಚಿನ ಶಸ್ತ್ರಚಿಕಿತ್ಸೆಗಳು ಮತ್ತು ಆಲ್ಕೋಹಾಲ್ ಬಳಕೆ, ಧೂಮಪಾನ, ತೂಕ ಹೆಚ್ಚಾಗುವುದು
        ಮತ್ತು ಭಾವನಾತ್ಮಕ ಒತ್ತಡದಂತಹ ಜೀವನಶೈಲಿಯ ಅಂಶಗಳAತಹ ಹಲವಾರು ವೈದ್ಯಕೀಯ
        ಕಾರಣಗಳಾಗಿರಬಹುದು.
      </div>
    ),
  },
  {
    id: "2",
    title: "ಅದಕ್ಕೆ ಚಿಕಿತ್ಸೆ ನೀಡಬಹುದೇ",
    contents: (
      <div>
        ಹೌದು, ಹೆಚ್ಚಿನ ಸಂದರ್ಭಗಳಲ್ಲಿ ಇದಕ್ಕೆ ಚಿಕಿತ್ಸೆ ನೀಡಬಹುದು. <br />
        <br />
        ಕೆಲವು ಸಂದರ್ಭಗಳಲ್ಲಿ, ದಂಪತಿಗಳು ಐವಿಎಫ್ (ಇನ್ ವಿಟ್ರೊ ಫರ್ಟಿಲೈಸೇಶನ್) ನಂತಹ ಸಹಾಯಕ
        ಸಂತಾನೋತ್ಪತ್ತಿ ತಂತ್ರಜ್ಞಾನಗಳ (ಎಆರ್‌ಟಿ) ಸಹಾಯವನ್ನು ಪಡೆಯುವಂತೆ ವೈದ್ಯರು ಶಿಫಾರಸು
        ಮಾಡುತ್ತಾರೆ. ಎಆರ್‌ಟಿ ಬಂಜೆತನದ ಕಾರಣವನ್ನು ಗುಣಪಡಿಸುವುದಿಲ್ಲ ಅಥವಾ ಚಿಕಿತ್ಸೆ
        ನೀಡುವುದಿಲ್ಲ ಆದರೆ ಪುರುಷನ ವೀರ್ಯಾಣುಗಳ ಸಂಖ್ಯೆಯು ಅತ್ಯಲ್ಪವಾಗಿದ್ದರೂ ಕೂಡ
        ದಂಪತಿಗಳು ಗರ್ಭಧಾರಣೆಯನ್ನು ಸಾಧಿಸಲು ಸಹಾಯ ಮಾಡಬಹುದು.
      </div>
    ),
  },
  {
    id: "3",
    title: "ಸಾಮಾನ್ಯ ವೀರ್ಯ ನಿಯತಾಂಕಗಳು ಯಾವುವು?",
    contents: (
      <div>
        ವಿಶ್ವ ಆರೋಗ್ಯ ಸಂಸ್ಥೆ (ಡಬ್ಲ್ಯೂ ಹೆಚ್ ಓ ) ವಿಶಿಷ್ಟ ವೀರ್ಯ ನಿಯತಾಂಕಗಳಿಗೆ ಈ
        ಕೆಳಗಿನ ಮಾರ್ಗಸೂಚಿಗಳನ್ನು ಶಿಫಾರಸು ಮಾಡಿದೆ.
        <table className="table-auto mt-6">
          <tr className="text-left">
            <th className="w-48">ಪ್ಯಾರಾಮೀಟರ್</th>
            <th className="w-48">ಡಬ್ಲ್ಯೂ ಹೆಚ್ ಓ 2010</th>
          </tr>
          <tr className="text-sm md:text-lg">
            <td>ಸಂಪುಟ</td>
            <td>1.5 ಮಿಲಿ</td>
          </tr>
          <tr className="text-sm md:text-lg">
            <td>ಸಾಂದ್ರತೆ</td>
            <td>15 ಮಿಲಿಯನ್/ಮಿಲಿ</td>
          </tr>
          <tr className="text-sm md:text-lg">
            <td>ಪ್ರಗತಿಶೀಲ ಚಲನಶೀಲತೆ</td>
            <td>ಶೇ. 32%</td>
          </tr>
          <tr className="text-sm md:text-lg">
            <td>ಸಾಮಾನ್ಯ ರೂಪಗಳು</td>
            <td>ಶೇ. 4%</td>
          </tr>
        </table>
      </div>
    ),
  },
  // {
  //   id: "4",
  //   title:
  //     "Will the semen parameters and sperm count become normal after treatment?",
  //   contents: (
  //     <div>
  //       There are chances it may become normal after treatment. It depends upon
  //       the cause of male infertility. Severe cases may not become normal after
  //       treatment.
  //     </div>
  //   ),
  // },
  {
    id: "5",
    title: "ಯಾವ ಆಹಾರದ ಬದಲಾವಣೆ ವೀರ್ಯಾಣು ಸಂಖ್ಯೆಯನ್ನು ಸುಧಾರಿಸುತ್ತದೆ?",
    contents: (
      <div>
        <ol className="list-decimal ml-5">
          <li>ಹಣ್ಣುಗಳು ಮತ್ತು ತರಕಾರಿಗಳ ಸೇವನೆ ಹೆಚ್ಚಿಸುವುದು.</li>
          <li>ಬೇಳೆ ಮತ್ತು ಪಾಲಕ್ ಸೇವನೆ ಹೆಚ್ಚಿಸುವುದು.</li>
          <li>
            ಸ್ಯಾಚುರೇಟೆಡ್ ಕೊಬ್ಬನ್ನು ಹೊಂದಿರುವ ಈ ಕೆಳಗಿನ ಆಹಾರಗಳÀನ್ನು ತಪ್ಪಿಸಿ
            <ul className="list-disc ml-10">
              <li>ಸಂಸ್ಕರಿಸಿದ ಆಹಾರಗಳು</li>
              <li>ಮಾಂಸ</li>
              <li>ಚೀಸ್‌ನಂತಹ ಡೈರಿ ಉತ್ಪನ್ನಗಳು</li>
            </ul>
          </li>
        </ol>
      </div>
    ),
  },
  {
    id: "6",
    title:
      "ಪುರುಷರ ಇನ್‌ಫರ್ಟಿಲಿಟಿ(ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ), ದೌರ್ಬಲ್ಯ, ನಿಮಿರುವಿಕೆಯಕಾರ್ಯಲೋಪ ಮತ್ತು ಅಕಾಲಿಕ ಸ್ಖಲನದ ನಡುವಿನ ವ್ಯತ್ಯಾಸಗಳು ಯಾವುವು?",
    contents: (
      <div>
        ಇನ್‌ಫರ್ಟಿಲಿಟಿ(ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ)ಯನ್ನು ಒಂದು ವರ್ಷದವರೆಗೆ ಗರ್ಭಧರಿಸಲು
        ಪ್ರಯತ್ನಿಸಿದ ನಂತರ ಗರ್ಭಧಾರಣೆಯನ್ನು ಸ್ಥಾಪಿಸಲು ಅಸಮರ್ಥತೆ ಎಂದು
        ವ್ಯಾಖ್ಯಾನಿಸಲಾಗಿದೆ. ದೌರ್ಬಲ್ಯ ಅಥವಾ ನಿಮಿರುವಿಕೆಯ ಅಪಸಾಮಾನ್ಯ ಕ್ರಿಯೆ ಎಂದರೆ
        ನಿಮಿರುವಿಕೆಯನ್ನು ಸಾಧಿಸಲು ಅಥವಾ ನಿರ್ವಹಿಸಲು ಮನುಷ್ಯನ ಅಸಮರ್ಥತೆ. ಅದೇ ಸಮಯದಲ್ಲಿ,
        ಅಕಾಲಿಕ ಸ್ಖಲನವನ್ನು ಕನಿಷ್ಠ ಪ್ರಚೋದನೆಯೊಂದಿಗೆ ಪುನರಾವರ್ತಿತ ಸ್ಖಲನ ಎಂದು
        ವಿವರಿಸಬಹುದು. ಆದರೂ, ಫರ್ಟಿಲಿಟಿ ಸಮಸ್ಯೆಗಳನ್ನು ಎದುರಿಸುತ್ತಿರುವ ಪುರುಷರು
        ಪ್ರಬಲರಾಗಿರಬಹುದು ಮತ್ತು ನಿಮಿರುವಿಕೆಯ ಕಾರ್ಯಲೋಪ ಹೊಂದಿರುವ ಪುರುಷರು ಇನ್ನೂ
        ಫರ್ಟಿಲಿಟಿ ಹೊಂದಿರಬಹುದು.
      </div>
    ),
  },
];

export const femaleInfertility = [
  {
    id: "1",
    title: "ಸ್ತ್ರೀ ಇನ್‌ಫರ್ಟಿಲಿಟಿ(ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ) ಎಂದರೇನು?",
    contents: (
      <div>
        ಇನ್‌ಫರ್ಟಿಲಿಟಿ ಎಂದರೆ ಒಂದು ವರ್ಷದ ಅಸುರಕ್ಷಿತ ಸಂಭೋಗದ ನಂತರ ಗರ್ಭಧರಿಸಲು
        ಅಸಮರ್ಥತೆ. ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯ ಕಾರಣಗಳಲ್ಲಿ ಮೂರನೇ ಒಂದು ಭಾಗವು ಪುರುಷ
        ಸಮಸ್ಯೆಯಿಂದ ಉಂಟಾಗುತ್ತದೆ; ಮೂರನೇ ಒಂದು ಭಾಗವು ಸ್ತ್ರೀ ಸಮಸ್ಯೆಯಿಂದ ಉಂಟಾಗುತ್ತದೆ
        ಮತ್ತು ಮೂರನೆಯದು ಸಂಯೋಜನೆ ಅಥವಾ ಅಜ್ಞಾತ ಕಾರಣಗಳು. ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ
        ಸ್ತಿçÃಲಿಂಗ ಪಾಲುದಾರರಿಂದ ಬಂದಾಗ, ಅದನ್ನು ಸ್ತ್ರೀ ಇನ್‌ಫರ್ಟಿಲಿಟಿ ಎಂದು
        ಪರಿಗಣಿಸಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "2",
    title: "ಸ್ತ್ರೀ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ ಎಷ್ಟು ಸಾಮಾನ್ಯವಾಗಿದೆ?",
    contents: (
      <div>
        ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆ ದಂಪತಿಗಳು ಎದುರಿಸುತ್ತಿರುವ ಪ್ರಚಲಿತ ಸವಾಲಾಗಿದೆ. ಕನಿಷ್ಠ
        ಶೇ. ೧೦ರಷ್ಟು ಮಹಿಳೆಯರು ಕೆಲವು ರೀತಿಯ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗಳನ್ನು
        ಹೊಂದಿರುತ್ತಾರೆ. ಮಹಿಳೆ ವಯಸ್ಸಾದಂತೆ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯ ಸಂಭವನೀಯತೆ
        ಹೆಚ್ಚಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "3",
    title: "ಸ್ತ್ರೀ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಕಾರಣವೇನು?",
    contents: (
      <div>
        <article>
          <span className="font-semibold">
            ಸ್ತ್ರೀ ಅಂಶ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಕೆಲವು ಕಾರಣಗಳು:
          </span>
          <h1 className="text-xl font-bold my-2">ಗರ್ಭಾಶಯದ ತೊಂದರೆಗಳು:</h1>
          <p className="text-md my-2">
            ಇದು ಗರ್ಭಾಶಯದ ಒಳಗಿನ ಪಾಲಿಪ್ಸ್, ಫೈಬ್ರಾಯ್ಡ್ಗಳು, ಸೆಪ್ಟಮ್ ಅಥವಾ ಅಂಗಗಳಲ್ಲಿನ
            ಅಂಟಿಕೊಳ್ಳುವಿಕೆಯನ್ನು ಒಳಗೊಂಡಿರುತ್ತದೆ. ಪಾಲಿಪ್ಸ್ ಮತ್ತು ಫೈಬ್ರಾಯ್ಡ್ಗಳು
            ರೂಪುಗೊಳ್ಳಲು ಯಾವುದೇ ಕಾರಣವಿಲ್ಲ. ಆದರೆ ಸೆಪ್ಟಮ್‌ನಂತಹ ಅಸಹಜತೆ ಹುಟ್ಟಿನಿಂದಲೇ
            ಇರುತ್ತದೆ. ಹಿಗ್ಗುವಿಕೆ ಮತ್ತು ಕ್ಯುರೆಟ್ಟೇಜ್ (ಡಿಎಂಡ್‌ಸಿ)ನAತಹ
            ಶಸ್ತçಚಿಕಿತ್ಸೆಯ ನಂತರ ಅಂಟಿಕೊಳ್ಳುವಿಕೆಗಳು ಸಂಭವಿಸಬಹುದು.
          </p>
          <h1 className="text-xl font-bold my-2">
            ಫಾಲೋಪಿಯನ್ ಟ್ಯೂಬ್‌ಗಳೊಂದಿಗಿನ ತೊಂದರೆಗಳು:
          </h1>
          <p className="text-md my-2">
            ಟ್ಯೂಬಲ್ ಅಂಶಗಳಿAದಾಗಿ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯು ಯಾವುದೇ ಸೊಂಟದ ಕಾಯಿಲೆಯ
            ಕಾರಣದಿಂದಾಗಿರಬಹುದು, ಸಾಮಾನ್ಯವಾಗಿ ಕ್ಲಮೈಡಿಯ ಮತ್ತು ಗೊನೊರಿಯಾ, ಟಿಬಿ ಅಥವಾ
            ಹಿಂದಿನ ಅಪಸ್ಥಾನೀಯ ಗರ್ಭಧಾರಣೆಯಿಂದ ಉಂಟಾಗುತ್ತದೆ.
          </p>
          <h1 className="text-xl font-bold my-2">ಅAಡೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗಳು:</h1>
          <p className="text-md my-2">
            ಹಲವು ಕಾರಣಗಳಿವೆ; ಮಹಿಳೆ ಏಕೆ ನಿಗದಿತವಾಗಿ ಅಂಡೋತ್ಪತ್ತಿ ಮಾಡುವುದಿಲ್ಲ
            (ಅಂಡಾಣುವನ್ನು ಬಿಡುಗಡೆ ಮಾಡುವುದು). ಹಾರ್ಮೋನುಗಳ ಅಸಮತೋಲನ, ಹಿಂದಿನ
            ಅಸ್ವಸ್ಥತೆ, ಮಾದಕ ದ್ರವ್ಯ ಸೇವನೆ, ಥೈರಾಯ್ಡ್ ಪರಿಸ್ಥಿತಿಗಳು, ತೀವ್ರ ಒತ್ತಡ
            ಮತ್ತು ಪಿಟ್ಯುಟರಿ ಗೆಡ್ಡೆಗಳು ಅಂಡೋತ್ಪತ್ತಿ ಮೇಲೆ ಪರಿಣಾಮ ಬೀರುವ ಕೆಲವು
            ವಿಷಯಗಳಾಗಿವೆ.
          </p>
          <h1 className="text-xl font-bold my-2">
            ಮೊಟ್ಟೆಗಳ ಸಂಖ್ಯೆ ಮತ್ತು ಗುಣಮಟ್ಟದ ಸಮಸ್ಯೆಗಳು:
          </h1>
          <p className="text-md my-2">
            ಮಹಿಳೆಯರು ತಮ್ಮಲ್ಲಿರುವ ಎಲ್ಲಾ ಅಂಡಾಣುಗಳೊAದಿಗೆ ಜನಿಸುತ್ತಾರೆ, ಮತ್ತು
            ಕೆಲವರಲ್ಲಿ, ಋತುಬಂಧಕ್ಕೆ ಮುಂಚಿತವಾಗಿಯೇ ಈ ಪೂರೈಕೆಯು ಖಾಲಿಯಾಗಬಹುದು. ಕೆಲವು
            ಅಂಡಾಣುಗಳುÄ ತಪ್ಪಾದ ಮೊನೊಮರ್‌ಗಳನ್ನು ಹೊಂದಿರಬಹುದು ಅದು ಫರ್ಟಿಲೈಸ್ ಆಗಲು ಅಥವಾ
            ಆರೋಗ್ಯಕರ ಭ್ರೂಣವಾಗಿ ಬೆಳೆಯಲು ಸಾಧ್ಯವಿಲ್ಲ. ಮಹಿಳೆ ವಯಸ್ಸಾದಂತೆ ಅಂಡಾಣು
            ಗುಣಮಟ್ಟ ಹದಗೆಡುತ್ತದೆ.
          </p>
        </article>
      </div>
    ),
  },
  {
    id: "4",
    title: "ಇದಕ್ಕೆ ಚಿಕಿತ್ಸೆ ನೀಡಬಹುದೇ?",
    contents: (
      <div>
        ಸ್ತ್ರೀ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯನ್ನು ಎಲ್ಲಾ ಸಂದರ್ಭಗಳಲ್ಲಿ ನಿಸ್ಸಂದೇಹವಾಗಿ
        ನಿರ್ವಹಿಸಬಹುದಾಗಿದೆ ಮತ್ತು ಹೆಚ್ಚಿನ ಸಂದರ್ಭಗಳಲ್ಲಿ ಗುಣಪಡಿಸಬಹುದಾಗಿದೆ. ನೆನಪಿಡಿ,
        ನೀವು ಒಬ್ಬಂಟಿಯಾಗಿಲ್ಲ. ನಮ್ಮ ತಜ್ಞರು ರೋಗನಿರ್ಣಯ ಕೈಗೊಳ್ಳುತ್ತಾರೆ ಮತ್ತು
        ಕಾರಣವನ್ನು ಗುರುತಿಸುತ್ತಾರೆ, ಬಳಿಕ ಸಂಭವನೀಯ ಚಿಕಿತ್ಸಾ ಆಯ್ಕೆಗಳ ಕಡೆಗೆ ನಿಮಗೆ
        ಮಾರ್ಗದರ್ಶನ ನೀಡುತ್ತಾರೆ. ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಕಾರಣವು ಆದ್ಯತೆಯ ಚಿಕಿತ್ಸಾ
        ವಿಧಾನವನ್ನು ನಿರ್ಧರಿಸುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "5",
    title: "ಸ್ತ್ರೀ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯ ದೃಷ್ಟಿಕೋನ ಏನು?",
    contents: (
      <div>
        ಸ್ತ್ರೀ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಯ ಮುನ್ನರಿವು, ವ್ಯಕ್ತಿ ಮತ್ತು ಮೂಲ ಆಧಾರವಾಗಿರುವ
        ವಿವರಣೆಯನ್ನು ಅವಲಂಬಿಸಿರುತ್ತದೆ. ಅಂಡೋತ್ಪತ್ತಿ ಸ್ಥಿತಿಗೆ ಚಿಕಿತ್ಸೆ ನೀಡಲು ಔಷಧಿಯು
        ಸಹಾಯ ಮಾಡುವ ಸಂದರ್ಭಗಳಲ್ಲಿ ಅಥವಾ ರಚನೆಯ ಅಸಹಜತೆಯನ್ನು (ಪಾಲಿಪ್ಸ್ ಅಥವಾ ಒಂಟಿ
        ಫೈಬ್ರಾಯ್ಡ್ಗಳು) ಸರಿಪಡಿಸಲು ಸುಲಭವಾದ ಶಸ್ತ್ರಚಿಕಿತ್ಸೆಗೆ ಸಹಾಯ ಮಾಡುವ
        ಸಂದರ್ಭಗಳಲ್ಲಿ, ದೃಷ್ಟಿಕೋನವು ಸಾಮಾನ್ಯವಾಗಿ ಸಕಾರಾತ್ಮಕವಾಗಿರುತ್ತದೆ. ನಿಮ್ಮ
        ಪರಿಸ್ಥಿತಿಯ ಮುನ್ನರಿವಿನ ಬಗ್ಗೆ ಇನ್ನಷ್ಟು ತಿಳಿದುಕೊಳ್ಳಲು ನಿಮ್ಮ ಕೇಸ್ ಹಿಸ್ಟರಿ,
        ಅಪಾಯದ ಅಂಶಗಳು ಮತ್ತು ಆಧಾರವಾಗಿರುವ ವೈದ್ಯಕೀಯ ಸಮಸ್ಯೆಗಳ ಬಗ್ಗೆ ನಿಮ್ಮ ಫರ್ಟಿಲಿಟಿ
        ವೈದ್ಯರನ್ನು ಕೇಳಿ. <br />
        <br /> ವೈದ್ಯಕೀಯ ವಿಜ್ಞಾನವು ಇಂದು ಸಂತಾನೋತ್ಪತ್ತಿ ಆರೋಗ್ಯದಲ್ಲಿ ಮಹತ್ತರವಾದ
        ಪ್ರಗತಿಯನ್ನು ಸಾಧಿಸಿದೆ ಮತ್ತು ಇಂದು ಬಹುತೇಕ ಎಲ್ಲಾ ಫರ್ಟಿಲಿಟಿ ಸವಾಲುಗಳಿಗೆ
        ಪರಿಹಾರವಿದೆ. ನೀವು ಸರಿಯಾದ ಆಸ್ಪತ್ರೆಗೆ ಭೇಟಿ ನೀಡುವ ಅಗತ್ಯವಿದೆ.
      </div>
    ),
  },
];

export const ivfProcedures = [
  {
    id: "1",
    title: "ಐಯುಐ ಎಂದರೇನು?",
    contents: (
      <div>
        ಗರ್ಭಾಶಯದೊಳಗಿನ ಗರ್ಭಧಾರಣೆ (ಐಯುಐ) ಎಂಬುದು ಒಂದು ವಿಧಾನವಾಗಿದ್ದು, ಇದರಲ್ಲಿ
        ವೀರ್ಯಾಣುವನ್ನು ತೊಳೆಯಲಾಗುತ್ತದೆ ಮತ್ತು ಕ್ಯಾಥೆಟರ್ ಮೂಲಕ ನೇರವಾಗಿ ಮಹಿಳೆಯ
        ಗರ್ಭಾಶಯದೊಳಗೆ ಇರಿಸಲಾಗುತ್ತದೆ, ಇದು ಗರ್ಭಿಣಿಯಾಗುವ ಸಾಧ್ಯತೆಯನ್ನು ಹೆಚ್ಚಿಸುತ್ತದೆ.
        ಕನಿಷ್ಠ ಒಂದು ಪೇಟೆಂಟ್ ಫಾಲೋಪಿಯನ್ ಟ್ಯೂಬ್ ಇರುವವರೆಗೆ, ವಿವಿಧ ಕಾರಣಗಳಿಗೆ
        ಸಂಬAಧಿಸಿದ ಸಂತಾನೋತ್ಪತ್ತಿ ಸಮಸ್ಯೆಗೆ ಚಿಕಿತ್ಸೆ ನೀಡಲು ಐಯುಐಅನ್ನು ಬಳಸಲಾಗುತ್ತದೆ.
        ಇನ್ ವಿಟ್ರೊ ಫಲೀಕರಣಕ್ಕೆ (ಐವಿಎಫ್) ಮುನ್ನ ಇದನ್ನು ಮಧ್ಯಂತರ ಮಟ್ಟದ ಮತ್ತು
        ವೆಚ್ಚ-ಪರಿಣಾಮಕಾರಿ ಹಸ್ತಕ್ಷೇಪವಾಗಿ ಬಳಸಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "2",
    title: "ಐಯುಐ ನೋವಿನಿಂದ ಕೂಡಿರುತ್ತದೆಯೇ? ಅದನ್ನು ಹೇಗೆ ನಡೆಸಲಾಗುತ್ತದೆ?",
    contents: (
      <div>
        ಮಹಿಳೆಯ ಯೋನಿಯೊಳಗೆ ಸ್ಪೆಕ್ಯುಲಮ್ ಅನ್ನು ಸೇರಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ತೊಳೆದ ವೀರ್ಯವನ್ನು
        ಹೊಂದಿರುವ ಲಗತ್ತಿಸಲಾದ ಸಿರಿಂಜ್‌ನೊAದಿಗೆ ಕ್ಯಾಥೆಟರ್ ಅನ್ನು ಗರ್ಭಕಂಠದ ಮೂಲಕ
        ಗರ್ಭಾಶಯದೊಳಗೆ ಸೇರಿಸಲಾಗುತ್ತದೆ. ಮಾದರಿಯನ್ನು ಚುಚ್ಚಿ ಒಳಗೆ ಸೇರಿಸಲಾಗುತ್ತದೆ ಮತ್ತು
        ಕ್ಯಾಥೆಟರ್ ಮತ್ತು ಸ್ಪೆಕ್ಯುಲಮ್ ಅನ್ನು ತೆಗೆದುಹಾಕಲಾಗುತ್ತದೆ. ಇದು
        ಅಸ್ವಸ್ಥತೆ/ಅನನುಕೂಲವನ್ನು ಉಂಟುಮಾಡಬಹುದು, ಅದರಲ್ಲೂ ಮುಖ್ಯವಾಗಿ ಕ್ಯಾಥೆಟರ್
        ಗರ್ಭಕಂಠದ ಮೂಲಕ ಹಾದುಹೋದಾಗ ಅಸ್ವಸ್ಥತೆ/ಅನನುಕೂಲ ಕಾಣಬಹುದು.
      </div>
    ),
  },
  {
    id: "3",
    title: "ನಾನು ಮೊದಲ ಬಾರಿಗೆ ಐಯುಐನಲ್ಲಿ ಯಶಸ್ವಿಯಾಗಬಹುದೇ?",
    contents: (
      <div>
        ನೀವು ಯಶಸ್ವಿಯಾಗುವ ಮುನ್ನ ಐಯುಐನ ಕೆಲವು ಆವರ್ತನಗಳು ಅಗತ್ಯವಾಗಬಹುದು. ಗರ್ಭಧಾರಣೆಯ
        ಸಾಧ್ಯತೆಯನ್ನು ಹೆಚ್ಚಿಸಲು ಕೆಲವೊಮ್ಮೆ, ೧ ಆವರ್ತನದಲ್ಲಿ ಎರಡು ಗರ್ಭಧಾರಣೆಯನ್ನು
        (ಡಬಲ್ ಇನ್ಸೆಮಿನೇಷನ್) ಒಂದರ ನಂತರ ಒಂದರAತೆ ಮಾಡುವುದನ್ನು ಶಿಫಾರಸು ಮಾಡಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "4",
    title: "ಐಯುಐ ಎಷ್ಟು ಯಶಸ್ವಿಯಾಗಿದೆ?",
    contents: (
      <div>
        ಪ್ರತಿಯೊಬ್ಬರ ಇತಿಹಾಸ ಮತ್ತು ಪ್ರತಿಕ್ರಿಯೆ ವಿಭಿನ್ನವಾಗಿರುತ್ತದೆ. ಸರಿಸುಮಾರು,
        ಔಷಧಿಗಳಿಲ್ಲದ ನೈಸರ್ಗಿಕ ಐಯುಐ ಶೇ. ೬-೧೦ರಷ್ಟು ಯಶಸ್ಸಿನ ಪ್ರಮಾಣವನ್ನು ಹೊಂದಿದೆ,
        ಆದರೆ ಫರ್ಟಿಲಿಟಿ ಔಷಧಿಗಳೊಂದಿಗೆ ಐಯುಐ ಸುಮಾರು ಶೇ. ೧೦-೨೦ರಷ್ಟು ಯಶಸ್ವಿಯಾಗಿದೆ.
      </div>
    ),
  },
  {
    id: "5",
    title: "ಐಯುಐ ಗೆ ಸಂಬAಧಿಸಿದ ಯಾವುದೇ ಅಪಾಯಗಳಿವೆಯೇ?",
    contents: (
      <div>
        ಐಯುಐ ಮಹಿಳೆಯ ದೇಹದ ಮೇಲೆ ಕಡಿಮೆ ಒತ್ತಡದ ಫರ್ಟಿಲಿಟಿ ಚಿಕಿತ್ಸೆಯಾಗಿದೆ, ವಿಶೇಷವಾಗಿ
        ರೋಗಿಯು ಫರ್ಟಿಲಿಟಿ ಔಷಧಿಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳದಿದ್ದರೆ. ಇದು ತುಂಬಾ ಕಡಿಮೆ ಸಂಬAಧಿತ
        ಅಪಾಯಗಳನ್ನು ಹೊಂದಿದೆ. ಆದಾಗ್ಯೂ, ಕಾರ್ಯವಿಧಾನದ ಸಮಯದಲ್ಲಿ ಅಥವಾ ನಂತರ ಸೆಳೆತ ಅಥವಾ
        ಅನಿಗದಿತ ರಕ್ತಸ್ರಾವ ಸಂಭವಿಸಬಹುದು.
      </div>
    ),
  },
  {
    id: "6",
    title: "ಐವಿಎಫ್ ಎಂದರೇನು?",
    contents: (
      <div>
        ಇನ್ ವಿಟ್ರೊ ಫಲೀಕರಣವನ್ನು (ಐವಿಎಫ್) ಹೆಚ್ಚು ಸರಳವಾಗಿ ‘ಟೆಸ್ಟ್-ಟ್ಯೂಬ್ ಬೇಬಿ' ಎಂದು
        ವಿವರಿಸಲಾಗಿದೆ. ಐವಿಎಫ್ ಪ್ರಕ್ರಿಯೆಯಲ್ಲಿ, ಹೆಣ್ಣಿನ ಅಂಡಾಶಯದಿAದ ಅಂಡಾಣುಗಳನ್ನು
        ತೆಗೆಯಲಾಗುತ್ತದೆ ಮತ್ತು ಅದೇ ಸಮಯದಲ್ಲಿ, ಪುರುಷ ಸಂಗಾತಿಯಿAದ ವೀರ್ಯಾಣುಗಳನ್ನು
        ಸಂಗ್ರಹಿಸಲಾಗುತ್ತದೆ. ಸಂಗ್ರಹಿಸಿದ ಅಂಡಾಣುಗಳು ಮತ್ತು ವೀರ್ಯಾಣುಗಳನ್ನು
        ಪ್ರಯೋಗಾಲಯದಲ್ಲಿ ಫರ್ಟಿಲೈಸ್ ಆಗಿಸಲು ತಯಾರಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ಫರ್ಟಿಲೈಸ್ ಆದ
        ಅಂಡಾಣುವನ್ನು(ಭ್ರೂಣ) ನಂತರ ಮಹಿಳೆಯ ಗರ್ಭದಲ್ಲಿ ಅಳವಡಿಸಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "7",
    title: "ಚಿಕಿತ್ಸೆ ಖಾತರಿಯಾಗಿದೆಯೇ? ಇಲ್ಲದಿದ್ದರೆ, ಏಕೆ?",
    contents: (
      <div>
        ಯಾವುದೇ ವೈದ್ಯಕೀಯ ಪರಿಸ್ಥಿತಿಗಳಿಗೆ ಚಿಕಿತ್ಸೆ ನೀಡುವಲ್ಲಿ ಗ್ಯಾರಂಟಿ ನೀಡುವುದು
        ಕಠಿಣವಾಗಿರುತ್ತದೆ. ಯಾರಾದರೂ ಹಾಗೆ ಮಾಡಿದರೆ, ಅವರು ನಿಮ್ಮನ್ನು ದಾರಿ
        ತಪ್ಪಿಸುತ್ತಿದ್ದಾರೆ ಎನ್ನಬಹುದು. ಯಶಸ್ಸಿನ ಪ್ರಮಾಣವು ರೋಗಿಯ ಮೇಲೆ
        ಅವಲಂಬಿತವಾಗಿರುತ್ತದೆ ಮತ್ತು ಪ್ರಕರಣವು ಕಡಿಮೆ ಸಂಕೀರ್ಣವಾಗಿದ್ದರೆ, ಯಶಸ್ಸಿನ
        ಪ್ರಮಾಣವು ಶೇ.೮೦ ರಿಂದ ಶೇ.೯೦ಕ್ಕೆ ಏರುತ್ತದೆ. ಸಮಸ್ಯೆಯು ಹೆಚ್ಚು
        ಸಂಕೀರ್ಣವಾಗಿದ್ದರೆ, ಅದು ಶೇ.೩೦-೪೦ರÀಷ್ಟು ಕುಸಿಯಬಹುದು
      </div>
    ),
  },
  {
    id: "8",
    title: "ಐಸಿಎಸ್‌ಐ ಎಂದರೇನು?",
    contents: (
      <div>
        ಐಸಿಎಸ್‌ಐ ಒಂದು ತಂತ್ರವಾಗಿದ್ದು, ಇದರಲ್ಲಿ ಒಂದು ವೀರ್ಯಾಣುವನ್ನು ನೇರವಾಗಿ
        ಚುಚ್ಚುಮದ್ದು ಮೂಲಕ ಅಂಡಾಣುವೊಳಕ್ಕೆ ಇರಿಸಿ ಅಂಡಾಣುವನ್ನು ಫರ್ಟಿಲೈಸ್ ಮಾಡಲಾಗುತ್ತದೆ
        ಅಲ್ಲದೇ ಫರ್ಟಿಲೈಸ್ ಆದ ಅಂಡಾಣುವನ್ನು (ಭ್ರೂಣ) ಗರ್ಭಕ್ಕೆ ವರ್ಗಾಯಿಸಲಾಗುತ್ತದೆ.
        ಸಂತಾನರಹಿತ ಪುರುಷರಿಗೆ ಇದು ಅತ್ಯಂತ ಕೈಗೆಟುವ ಮತ್ತು ಯಶಸ್ವಿ ಚಿಕಿತ್ಸೆಗಳಲ್ಲಿ
        ಒಂದಾಗಿದೆ.
      </div>
    ),
  },
  {
    id: "9",
    title: "ಲೇಸರ್ ನೆರವಿನ ಹ್ಯಾಚಿಂಗ್ ಎಂದರೇನು?",
    contents: (
      <div>
        ಲೇಸರ್ ಅಸಿಸ್ಟೆಡ್ ಹ್ಯಾಚಿಂಗ್ ಎನ್ನುವುದು ಒಂದು ತಂತ್ರವಾಗಿದ್ದು, ಭ್ರೂಣದ ಹೊರ
        ಪದರವನ್ನು ಸ್ವಲ್ಪಮಟ್ಟಿಗೆ ತೆರೆಯಲಾಗುತ್ತದೆ ಮತ್ತು ಗರ್ಭಾಶಯದೊಳಗೆ ಭ್ರೂಣವನ್ನು
        ಸುಲಭವಾಗಿ ಅಳವಡಿಸಲು ಅನುಕೂಲವಾಗುವಂತೆ ಲೇಸರ್ ಮೂಲಕ ಒಂದು ಕಡೆಯಲ್ಲಿ
        ದುರ್ಬಲಗೊಳಿಸಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "10",
    title: "ಬ್ಲಾಸ್ಟೊಸಿಸ್ಟ್ ಸಂಸ್ಕೃತಿ ಎಂದರೇನು?",
    contents: (
      <div>
        ಬ್ಲಾಸ್ಟೊಸಿಸ್ಟ್ ಕಲ್ಚರ್ ಅಂಡ್ ಟ್ರಾನ್ಸ್ಫರ್ ಎನ್ನುವುದು ಭ್ರೂಣವನ್ನು ಗರ್ಭದಲ್ಲಿ
        ಇರಿಸುವ ಮುನ್ನ ಫರ್ಟಿಲೈಸೇಷನ್‌ನಂತರÀ ೪-೬ ದಿನಗಳವರೆಗೆ ಪ್ರಯೋಗಾಲಯದಲ್ಲಿ
        ಅಭಿವೃದ್ಧಿಪಡಿಸುವ ತಂತ್ರವಾಗಿದೆ. ಭ್ರೂಣವು ಇಷ್ಟು ದಿನಗಳವರೆಗೆ ಅಭಿವೃದ್ಧಿ
        ಹೊಂದುವುದರಿAದ ಅನೇಕ ಜೀವಕೋಶಗಳನ್ನು ಪಡೆಯುತ್ತದೆ. ೪-೬ ದಿನಗಳವರೆಗೆ
        ಅಭಿವೃದ್ಧಿಪಡಿಸಿದ ಭ್ರೂಣಗಳು ಕೇವಲ ಮೂರು ದಿನಗಳವರೆಗೆ ಅಭಿವೃದ್ಧಿ ಹೊಂದಿದವುಗಳಿಗಿAತ
        ಹೆಚ್ಚು ಮುಂದುವರಿದಿರುತ್ತವೆ, ಹೀಗಾಗಿ ಯಶಸ್ಸಿನ ಹೆಚ್ಚಿನ ಅವಕಾಶಗಳನ್ನು
        ಹೊಂದಿರುತ್ತವೆ.
      </div>
    ),
  },
  {
    id: "11",
    title: "ಐವಿಎಫ್ ಚಿಕಿತ್ಸೆಗೆ ಎಷ್ಟು ಸಮಯ ತೆಗೆದುಕೊಳ್ಳುತ್ತದೆ?",
    contents: (
      <div>
        ಐವಿಎಫ್ ಚಿಕಿತ್ಸೆಯ ಒಟ್ಟಾರೆ ಅವಧಿಯು ೩-೪ ತಿಂಗಳುಗಳಾಗಿರುತ್ತದೆ. ನಿಮ್ಮ ಭೇಟಿಯ
        ಸಮಯದಲ್ಲಿ, ನೀವು ವೈದ್ಯರೊಂದಿಗೆ ಸಮಾಲೋಚಿಸುತ್ತೀರಿ, ಮತ್ತು ಸಲಹೆ, ಸಮಾಲೋಚನೆಯ ನಂತರ,
        ವೈದ್ಯರು ನಿಮಗೆ ತಪಾಸಣೆಗೆ ಒಳಗಾಗಲು ಕೇಳುತ್ತಾರೆ. ವರದಿಗಳ ಆಧಾರದ ಮೇಲೆ, ನೀವು
        ಮುಂದಿನ (ಸಾಮಾನ್ಯವಾಗಿ ೧-೩ ತಿಂಗಳ ನಡುವೆ) ಯಾವಾಗ ಭೇಟಿ ನೀಡಬೇಕೆಂದು ವೈದ್ಯರು ನಿಮಗೆ
        ತಿಳಿಸುತ್ತಾರೆ.
      </div>
    ),
  },
  {
    id: "12",
    title: "ಮೊದಲ ಬಾರಿಗೆ ಭೇಟಿ ನೀಡಿದಾಗ ನಾನು ನನ್ನೊಂದಿಗೆ ಏನು ಕೊಂಡೊಯ್ಯಬೇಕು?",
    contents: (
      <div>
        ನಿಮ್ಮ ಮತ್ತು ನಿಮ್ಮ ಸಂಗಾತಿಯ ಐಡಿ ಪುರಾವೆ ಮತ್ತು ಪಾಸ್‌ಪೋರ್ಟ್ ಗಾತ್ರದ
        ಭಾವಚಿತ್ರವನ್ನು ನೀವು ಒಯ್ಯಬೇಕು. ಅಲ್ಲದೆ, ನೀವು ಹಿಂದೆ ಯಾವುದೇ ಸಮಯದಲ್ಲಿ ತಪಾಸಣೆಗೆ
        ಒಳಗಾಗಿದ್ದರೆ, ಲಭ್ಯವಿದ್ದಲ್ಲಿ ವರದಿಗಳನ್ನು ನಿಮ್ಮೊಂದಿಗೆ ಕೊಂಡೊಯ್ಯಿರಿ.
      </div>
    ),
  },
  {
    id: "13",
    title: "ಮೊದಲ ಭೇಟಿಯ ಸಮಯದಲ್ಲಿ ಯಾವ ಪರೀಕ್ಷೆಗಳನ್ನು ಮಾಡಲಾಗುವುದು?",
    contents: (
      <div>
        ನೀವು ಮೊದಲ ಬಾರಿಗೆ ಭೇಟಿ ನೀಡಿದಾಗ, ಸಂಗಾತಿಗಳಿಬ್ಬರ ರಕ್ತ ಪರೀಕ್ಷೆಗಳು,
        ಅಲ್ಟಾçಸೌಂಡ್ ಮತ್ತು ವೀರ್ಯ ವಿಶ್ಲೇಷಣೆ ಮಾಡಲಾಗುತ್ತದೆ.
      </div>
    ),
  },
  {
    id: "14",
    title:
      "ನಾವು ಐವಿಎಫ್‌ನ ಎರಡು ಪ್ರಯತ್ನಗಳಿಗಿಂತ ಹೆಚ್ಚು ಬಾರಿ ವಿಫಲರಾಗಿದ್ದೇವೆ. ನಾವೀಗ ಏನು ಮಾಡಬೇಕು?",
    contents: (
      <div>
        ನೀವು ಈಗಾಗಲೇ ಐವಿಎಫ್‌ಅನ್ನು ಪ್ರಯತ್ನಿಸಿದ್ದರೆ, ನಿಮ್ಮ ಎಲ್ಲಾ ಹಿಂದಿನ ವೈದ್ಯಕೀಯ
        ವರದಿಗಳೊಂದಿಗೆ ನಮ್ಮ ಆಸ್ಪತ್ರೆಗೆ ಭೇಟಿ ನೀಡಲು ನಾವು ಸಲಹೆ ನೀಡುತ್ತೇವೆ. ನಿಮ್ಮ
        ಹಿಂದಿನ ಐವಿಎಫ್ ಏಕೆ ವಿಫಲವಾಗಿದೆ ಮತ್ತು ಐವಿಎಫ್‌ನಲ್ಲಿ ಯಶಸ್ಸನ್ನು ಸಾಧಿಸಲು ನಿಮ್ಮ
        ಪ್ರಕರಣದಲ್ಲಿ ಯಾವ ಪ್ರಗತಿಪರ ತಂತ್ರಗಳನ್ನು ಬಳಸಬಹುದು ಎಂದು ವೈದ್ಯರು ನಿಮಗೆ
        ತಿಳಿಸುತ್ತಾರೆ.
      </div>
    ),
  },
];
